Rouben94/P6_Software/Zigbee/nRF5_SDK_for_Thread_and_Zigbee_v4.0.0_dc7186b (2)/examples/multiprotocol/ble_zigbee/ble_zigbee_dynamic_door_lock_nus/main.c
/**@brief Functiom which essentially sets the lock state via PWM and stores the value in flash.
 * 
 * @param[in] value ZB_ZCL_ATTR_DOOR_LOCK_LOCK_STATE_LOCKED to lock,
 *                  ZB_ZCL_ATTR_DOOR_LOCK_LOCK_STATE_UNLOCKED to unlock.
 */
static zb_void_t set_lock_state(zb_uint8_t value)
{


    if (value == ZB_ZCL_ATTR_DOOR_LOCK_LOCK_STATE_LOCKED)
    {
        m_dev_ctx.configuration.is_locked = (uint32_t) true;
        bsp_board_led_on(DOOR_LOCK_STATE_LED);
        while (app_pwm_channel_duty_set(&LOCK_MECHANISM_PWM_NAME, 0, LOCK_MECHANISM_STATE_CLOSE_DC) == NRF_ERROR_BUSY)
        {
        }
        UNUSED_RETURN_VALUE(zb_zcl_set_attr_val(DOOR_LOCK_ENDPOINT,
                                                ZB_ZCL_CLUSTER_ID_DOOR_LOCK,
                                                ZB_ZCL_CLUSTER_SERVER_ROLE,
                                                ZB_ZCL_ATTR_DOOR_LOCK_LOCK_STATE_ID,
                                                &value,
                                                ZB_FALSE));
    }
    else if (value == ZB_ZCL_ATTR_DOOR_LOCK_LOCK_STATE_UNLOCKED)
    {
        m_dev_ctx.configuration.is_locked = (uint32_t) false;
        bsp_board_led_off(DOOR_LOCK_STATE_LED);
        while (app_pwm_channel_duty_set(&LOCK_MECHANISM_PWM_NAME, 0, LOCK_MECHANISM_STATE_OPEN_DC) == NRF_ERROR_BUSY)
        {
        }
        UNUSED_RETURN_VALUE(zb_zcl_set_attr_val(DOOR_LOCK_ENDPOINT,
                                                ZB_ZCL_CLUSTER_ID_DOOR_LOCK,
                                                ZB_ZCL_CLUSTER_SERVER_ROLE,
                                                ZB_ZCL_ATTR_DOOR_LOCK_LOCK_STATE_ID,
                                                &value,
                                                ZB_FALSE));
    }
    else 
    {
        NRF_LOG_WARNING("Wrong value of lock state - omitting");
        return;
    }

    ret_code_t        err_code;
    fds_record_desc_t desc = {0};
    fds_find_token_t  tok  = {0};

    err_code = fds_record_find(DOOR_LOCK_CONFIG_FILE, DOOR_LOCK_CONFIG_STATE_KEY, &desc, &tok);
    APP_ERROR_CHECK(err_code);
    
    err_code = fds_record_update(&desc, &m_configuration_record);
    APP_ERROR_CHECK(err_code);
    /* Set the garbage flag to dispatch the garbage collector. */
    m_garbage_flag = true;
}

/**@brief Function for initializing all clusters attributes.
 */
static void door_lock_clusters_attr_init(void)
{
    /* Basic cluster attributes data */
    m_dev_ctx.basic_attr.zcl_version   = ZB_ZCL_VERSION;
    m_dev_ctx.basic_attr.app_version   = DOOR_LOCK_BASIC_APP_VERSION;
    m_dev_ctx.basic_attr.stack_version = DOOR_LOCK_BASIC_STACK_VERSION;
    m_dev_ctx.basic_attr.hw_version    = DOOR_LOCK_BASIC_HW_VERSION;

    /* Use ZB_ZCL_SET_STRING_VAL to set strings, because the first byte should
     * contain string length without trailing zero.
     *
     * For example "test" string wil be encoded as:
     *   [(0x4), 't', 'e', 's', 't']
     */
    ZB_ZCL_SET_STRING_VAL(m_dev_ctx.basic_attr.mf_name,
                          DOOR_LOCK_BASIC_MANUF_NAME,
                          ZB_ZCL_STRING_CONST_SIZE(DOOR_LOCK_BASIC_MANUF_NAME));

    ZB_ZCL_SET_STRING_VAL(m_dev_ctx.basic_attr.model_id,
                          DOOR_LOCK_BASIC_MODEL_ID,
                          ZB_ZCL_STRING_CONST_SIZE(DOOR_LOCK_BASIC_MODEL_ID));

    ZB_ZCL_SET_STRING_VAL(m_dev_ctx.basic_attr.date_code,
                          DOOR_LOCK_BASIC_DATE_CODE,
                          ZB_ZCL_STRING_CONST_SIZE(DOOR_LOCK_BASIC_DATE_CODE));

    m_dev_ctx.basic_attr.power_source = DOOR_LOCK_BASIC_POWER_SOURCE;

    ZB_ZCL_SET_STRING_VAL(m_dev_ctx.basic_attr.location_id,
                          DOOR_LOCK_BASIC_LOCATION_DESC,
                          ZB_ZCL_STRING_CONST_SIZE(DOOR_LOCK_BASIC_LOCATION_DESC));


    m_dev_ctx.basic_attr.ph_env = DOOR_LOCK_BASIC_PH_ENV;

    /* Identify cluster attributes data */
    m_dev_ctx.identify_attr.identify_time = ZB_ZCL_IDENTIFY_IDENTIFY_TIME_DEFAULT_VALUE;

    /* Door Lock cluster attributes data */
    m_dev_ctx.door_lock_attr.lock_type        = ZB_ZCL_ATTR_DOOR_LOCK_LOCK_TYPE_OTHER;
    m_dev_ctx.door_lock_attr.lock_state       = m_dev_ctx.configuration.is_locked ? ZB_ZCL_ATTR_DOOR_LOCK_LOCK_STATE_LOCKED : ZB_ZCL_ATTR_DOOR_LOCK_LOCK_STATE_UNLOCKED;
    m_dev_ctx.door_lock_attr.actuator_enabled = ZB_TRUE;

    if ((bool)m_dev_ctx.configuration.is_locked == false)
    {
        set_lock_state(ZB_ZCL_ATTR_DOOR_LOCK_LOCK_STATE_UNLOCKED);
    }
    else
    {
        set_lock_state(ZB_ZCL_ATTR_DOOR_LOCK_LOCK_STATE_LOCKED);
    }
}

/**@brief Perform local operation - leave network.
 *
 * @param[in]   bufid   Reference to Zigbee stack buffer that will be used to construct leave request.
 */
static void door_lock_leave_nwk(zb_bufid_t bufid)
{
    zb_ret_t zb_err_code;

    // We are going to leave
    if (bufid)
    {
        zb_zdo_mgmt_leave_param_t * p_req_param;

        p_req_param = ZB_BUF_GET_PARAM(bufid, zb_zdo_mgmt_leave_param_t);
        UNUSED_RETURN_VALUE(ZB_BZERO(p_req_param, sizeof(zb_zdo_mgmt_leave_param_t)));

        // Set dst_addr == local address for local leave
        p_req_param->dst_addr = ZB_PIBCACHE_NETWORK_ADDRESS();
        p_req_param->rejoin   = ZB_FALSE;
        UNUSED_RETURN_VALUE(zdo_mgmt_leave_req(bufid, NULL));
    }
    else
    {
        zb_err_code = zb_buf_get_out_delayed(door_lock_leave_nwk);
        ZB_ERROR_CHECK(zb_err_code);
    }
}

/**@brief Function for starting join/rejoin procedure.
 *
 * param[in]   leave_type   Type of leave request (with or without rejoin).
 */
static zb_void_t door_lock_retry_join(zb_uint8_t leave_type)
{
    zb_bool_t comm_status;

    if (leave_type == ZB_NWK_LEAVE_TYPE_RESET)
    {
        comm_status = bdb_start_top_level_commissioning(ZB_BDB_NETWORK_STEERING);
        ZB_COMM_STATUS_CHECK(comm_status);
    }
}

/**@brief Function for leaving current network and starting join procedure afterwards.
 *
 * @param[in]   bufid   Optional reference to Zigbee stack buffer to be reused by leave and join procedure.
 */
static zb_void_t door_lock_leave_and_join(zb_bufid_t bufid)
{
    if (ZB_JOINED())
    {
        // Leave network. Joining procedure will be initiated inisde Zigbee stack signal handler.
        door_lock_leave_nwk(bufid);
    }
    else
    {
        // Already left network. Start joining procedure.
        door_lock_retry_join(ZB_NWK_LEAVE_TYPE_RESET);

        if (bufid)
        {
            zb_buf_free(bufid);
        }
    }
}

/**@brief Handler of the FDS events.
 * 
 * @param[in] p_evt Pointer to the FDS context.
 */
static void fds_evt_handler(fds_evt_t const * p_evt)
{
    switch (p_evt->id)
    {
        case FDS_EVT_INIT:
            if (p_evt->result == NRF_SUCCESS)
            {
                m_fds_initialized = true;
            }
            break;

        default:
            break;
    }
}

/**@brief Function to initialise FDS storage and read the initial lock state out of it.
 */
static void storage_init(void)
{
    ret_code_t err_code;

